[
  {
    "table": "arrests",
    "description": "Citywide arrests in Boston; one row per arrest/booking with event date, location, and offense context. Use for counts by time, neighborhood, and offense type.",
    "metadata_file": "arrests.json"
  },
  {
    "table": "dorchester_311",
    "description": "311 service requests for Dorchester; one row per request with created/closed dates, request type, status, and (often) coordinates. Use for workload trends and category breakdowns.",
    "metadata_file": "dorchester_311.json"
  },
  {
    "table": "dorchester_boston_arrests",
    "description": "Arrests covering Boston with a Dorchester indicator to compare neighborhood vs. city totals. Same grain as arrests (one row per arrest).",
    "metadata_file": "dorchester_boston_arrests.json"
  },
  {
    "table": "dorchester_boston_homicides",
    "description": "Homicide incidents for Boston with a Dorchester flag; one row per incident with date and location. Use for yearly trends and neighborhood comparisons.",
    "metadata_file": "dorchester_boston_homicides.json"
  },
  {
    "table": "dorchester_boston_offenses",
    "description": "Reported offenses in Boston with a Dorchester indicator; one row per offense report. Useful for offense mix comparisons across geographies/time.",
    "metadata_file": "dorchester_boston_offenses.json"
  },
  {
    "table": "dorchester_firearms_counts",
    "description": "Firearm-related activity summarized for Dorchester (typically counts by period and/or area). Use for time-series comparisons and hotspot scans.",
    "metadata_file": "dorchester_firearms_counts.json"
  },
  {
    "table": "dorchester_person_shot",
    "description": "Shooting victim records limited to Dorchester; one row per victim/incident with date and location. Use for victimization trends.",
    "metadata_file": "dorchester_person_shot.json"
  },
  {
    "table": "dorchester_shots_fired",
    "description": "Shots-fired incidents or calls in Dorchester; one row per event with date and (often) coordinates. Use for temporal patterns and clustering.",
    "metadata_file": "dorchester_shots_fired.json"
  },
  {
    "table": "firearms",
    "description": "Citywide firearm-related records for Boston (e.g., incidents/seizures depending on source). One row per event. Check metadata for exact definitions.",
    "metadata_file": "firearms.json"
  },
  {
    "table": "homicides",
    "description": "Citywide homicide incidents in Boston; one row per incident with date and location. Use for annual trends and neighborhood breakdowns.",
    "metadata_file": "homicides.json"
  },
  {
    "table": "offenses",
    "description": "Citywide reported offenses for Boston; one row per offense report with offense category and timing. Use for offense mix and seasonal trends.",
    "metadata_file": "offenses.json"
  },
  {
    "table": "person_shot",
    "description": "Citywide shooting victim records in Boston; one row per victim/incident. Use for year-over-year changes and spatial comparisons.",
    "metadata_file": "person_shot.json"
  },
  {
    "table": "service_requests",
    "description": "Citywide 311 service requests for Boston; one row per request with lifecycle fields (created/closed), request type, status, and often geolocation.",
    "metadata_file": "service_requests.json"
  },
  {
    "table": "shots_fired",
    "description": "Citywide shots-fired incidents/calls in Boston; one row per event with date and location. Use for trend analysis and hotspot identification.",
    "metadata_file": "shots_fired.json"
  }
]